app/controllers/links_controller.rb

  def create
    @link = Link.new(link_params)

    respond_to do |format|
      if @link.save
---
INSERT INTO "links" ("title", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Yooo"], ["url", "https://github.com/emmanuellekamwa/micro-reddit"], ["created_at", "2021-01-22 16:39:36.456352"], ["updated_at", "2021-01-22 16:39:36.456352"]]

  def update
    respond_to do |format|
      if @link.update(link_params)
---
UPDATE "links" SET "title" = ?, "url" = ?, "updated_at" = ? WHERE "links"."id" = ?  [["title", "Hello"], ["url", "https://github.com"], ["updated_at", "2021-01-22 16:42:18.783096"], ["id", 1]]